Revit 2027 API
SketchedCurveSlopeOption Enumeration
 The option determines the slop of the sketched run/landing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SketchedCurveSlopeOption
Public Enumeration SketchedCurveSlopeOption
public enum class SketchedCurveSlopeOption
type SketchedCurveSlopeOption
Members
Member name | Value | Description
Auto | 0 |  The slope of the sketched run/landing will be auto detected.
Flat | 1 |  The slope of the sketched run/landing will be kept flat.
Sloped | 2 |  The slope of the sketched run/landing will be specified by users.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace